andreasdahl1987/DahlDesignDDC/hardware/DDC/avr/boards.txt
DDC.name=Dahl Design Controller
        
DDC.upload.tool=arduino:avrdude
DDC.upload.protocol=avr109
DDC.upload.maximum_size=28672
DDC.upload.maximum_data_size=2560
DDC.upload.speed=57600
DDC.upload.disable_flushing=true
DDC.upload.use_1200bps_touch=true
DDC.upload.wait_for_upload_port=true
DDC.bootloader.tool=arduino:avrdude
DDC.bootloader.low_fuses=0xff
DDC.bootloader.high_fuses=0xd8
DDC.bootloader.extended_fuses=0xcb
DDC.bootloader.file=caterina/Caterina-Leonardo.hex
DDC.bootloader.unlock_bits=0x3F
DDC.bootloader.lock_bits=0x2F     
DDC.build.mcu=atmega32u4
DDC.build.f_cpu=16000000L

DDC.build.vid=0x35F9
DDC.build.pid=0x0DDC
DDC.build.usb_product="Dahl Design Controller"

DDC.build.usb_manufacturer="Dahl Design"
DDC.build.board=AVR_LEONARDO
DDC.build.core=arduino:arduino
DDC.build.variant=arduino:leonardo
DDC.build.extra_flags={build.usb_flags}
